'use strict'
const uuid = require('uuid').v4

module.exports = {
  up: (queryInterface, Sequelize) => {
    return queryInterface.bulkInsert('questions', [
      {
        whatif: 'میتونستی توی یه سیاره با چند گونه مختلف منتخب از فضایی ها زندگی کنی',
        but: 'دیگه نمیتونستی به زمین برگردی',
      },
      {
        whatif: 'میتونستی یه کار خیلی غیر قانونی انجام بدی',
        but: 'هیچکس روحشم خبردار نمیشد',
      },
      {
        whatif: 'حقیقت زندگی رو پیدا میکردی',
        but: 'باید هرچیزی که تاحالا یاد گرفتی رو فراموش میکردی',
      },
      {
        whatif: 'دو میلیون نفر میشناختنت',
        but: 'باید هر روز یکار چیپ کنی و از خودت فیلم بگیری',
      },
      {
        whatif: 'وقتی مردی به هرچیزی دوست داشتی میرسی',
        but: 'باید هرروز ۱ ساعت عذاب بکشی',
      },
      {
        whatif: 'هرروز از ساعت ۱ تا ۴ بعد از ظهر خیلی باهوش و قوی و خوشکل میشدی',
        but: 'ساعتای دیگه همون حالتارو نصف حالت عادی داشتی',
      },
      {
        whatif: 'پولدارترین آدم کشور بودی',
        but: 'سردسته فروش مواد مخدر بودی',
      },
      {
        whatif: 'هر روز ۵۰۰ هزارتومن میگرفتی',
        but: 'هر روز رنگ موهات عوض میشد',
      },
      {
        whatif: 'میتونستی ۵۰ سال در آینده سفر کنی',
        but: '۲۰ سال بعدش میمردی',
      },
      {
        whatif: 'میتونستی ظاهر پارتنرتو تعیین کنی هرجور دوست داری',
        but: 'اونم همین کارو میتونه بکنه',
      },
      {
        whatif: 'میتونستی شاه یا ملکه یه جایی بشی',
        but: 'باید با ینفر که دوست نداری ازدواج کنی',
      },
      {
        whatif: 'زندگی همه مردم دنیا لذت بخش و عالی بود',
        but: 'تو باید واسه ۲۰ سال شکنجه میشدی',
      },
      {
        whatif: 'میتونستی تو زمان سفر کنی',
        but: 'همیشه تنها بودی و با هیچکس نمیتونستی صحبت کنی',
      },
      {
        whatif: 'میتونستی یک سال آینده رو ببینی',
        but: 'هرسال دوسال از اول زندگیت یادت میرفت',
      },
      {
        whatif: 'همه مردم سیاه‌پوست بودن',
        but: 'تو سفید پوست بودی',
      },
      {
        whatif: 'همه باد معده هات بی صدا بودن',
        but: 'بوشون دوبرابر بدتر بود',
      },
      {
        whatif: 'یخچالت همیشه پر از خوردنی های خوشمزه بود',
        but: 'هر هفته باید تو نماز جمعه شرکت میکردی',
      },
      {
        whatif: 'یکی از لاکچری ترین ویلا ها رو تو بهترین منطقه تهران داشتی',
        but: 'همه عمرت باید ایران میموندی',
      },
      {
        whatif: 'هر روز میتونستی با ینفر باشی و هیچکس نفهمه',
        but: 'ناهارتو همیشه باید نون پنیر میخوردی',
      },
      {
        whatif: 'میتونستی مرد عنکبوتی باشی',
        but: 'هیچوقت نمیتونستی لباستو عوض کنی',
      },
      {
        whatif: 'میتونستی رئیس جمهور باشی و قدرتمند ترین آدم کشور',
        but: 'باید به مردم یچیزایی بگی که میدونی حقیقت ندارن',
      },
      {
        whatif: 'تا آخر زندگیت خوشحال و خوشبخت بودی',
        but: 'همیشه فقیر بودی و سبزی میفروختی',
      },
      {
        whatif: 'هر روز آگاهیت از خودت حداکثر میشد و باهوش تر و آرام تر بودی',
        but: 'باید هر روز صبح ساعت ۶ به مدت ۱ ساعت مدیتیشن میکردی',
      },
      {
        whatif: 'حقوقت چهار برابر میشد',
        but: 'قدت نصف میشد',
      },
      {
        whatif: 'یه جعبه داشتی که هرچیزی رو نامرئی میکرد',
        but: 'همیشه باید کفش و جوراباتو نامرئی کنی',
      },
      {
        whatif: 'میتونستی بفهمی چطوری قراره بمیری',
        but: 'هیچجوره دیگه نمیتونستی تغییرش بدی',
      },
      {
        whatif: 'میتونستی با ابی یه هفته برید بگردید و عشق و حال کنید',
        but: 'باید توی آهنگ بعدیش میرقصیدی',
      },
      {
        whatif: 'صلح بر همه‌جا حکم فرما بود',
        but: 'اینترنت وجود نداشت',
      },
      {
        whatif: 'میتونستی یروز ۵۰۰ سال در آینده سفر کنی',
        but: 'وفتی برمیگشتی با هیچکس نمیتونستی رابطه داشته باشی',
      },
      {
        whatif: 'میتونستی هر لباسی دلت میخواد رو از هر مغازه ای مفتی بگیری',
        but: 'هیچوقت لباسات با هم ست نبود',
      },
      {
        whatif: 'همه غذاهایی که میخوری رو یه آشپز حرفه ای درست میکرد',
        but: 'همیشه باید با دست غذا میخوردی همه جا',
      },
      {
        whatif: 'ترافیک و آلودگی هوا از بین میرفت',
        but: 'باید همیشه از وسیله نقلیه عمومی استفاده میکردی',
      },
      {
        whatif: 'اینترنتت نامحدود میشد با سرعت خیلی خفن!',
        but: 'هفته ای یبار یروز کلا اینترنت نداشتی',
      },
      {
        whatif: 'یه راننده شخصی داشتی که هرموقع و هرجا میبردت رایگان',
        but: 'ماشینش پیکان بود',
      },
      {
        whatif: 'همه مردم سفید پوست بودن',
        but: 'تو سیاه پوست بودی',
      },
      {
        whatif: 'حجاب آزاد میشد',
        but: 'تو ماشین همیشه باید رادیو گوش میکردی',
      },
      {
        whatif: 'میتونستی پنجاه سال سالم بیشتر زندگی کنی',
        but: 'هیچوقت نمیتونستی جوراب و لباس زیرتو عوض کنی',
      },
      {
        whatif: 'اگه میتونستی رو آب راه بری',
        but: 'نمیتونستی شنا کنی',
      },
      {
        whatif: 'حافظت عالی بود',
        but: 'هرگز نمیتونستی اسم کسی رو بیاد بیاری',
      },
      {
        whatif: 'همیشه آخرین موبایل پرچمدار اندروید رو داشتی',
        but: 'هیچوقت دیگه نمیتونستی از محصولات اپل استفاده کنی',
      },
      {
        whatif: 'سریع ترین اینترنت جهان رو داشتی',
        but: 'باید ۵ تا سگ بامزه رو جلوی بچه‌های ۷ ساله میکشتی',
      },
      {
        whatif: 'همیشه خوشحال بودی',
        but: 'توی کره شمالی زندگی میکردی',
      },
      {
        whatif: 'هیجوقت نمیباختی',
        but: 'هیجوقت عاشق نمیشدی',
      },
      {
        whatif: 'شغل رویاییت رو داشتی و توش بهترین بودی',
        but: 'نهایتا میتونستی ماهی ۱ میلیون دربیاری',
      },
      {
        whatif: 'پنج نفر از موفق ترین افراد رو انتخاب میکردی که رفیقت باشن',
        but: 'باید پنج نفر رو انتخاب میکردی که زندگیشون نابود بشه',
      },
      {
        whatif: 'همه هزینه‌ها فقط برای تو میشد',
        but: 'لبات چهاربرابر میشد',
      },
      {
        whatif: 'همیشه آخرین آیفون رو اولین نفر داشتی',
        but: 'ولی باید لخت کامل به فروشگاه اپل میرفتی تا بگیریش',
      },
      {
        whatif: 'میتونستی خواب و رویاهای دیگران رو ببینی',
        but: 'دیگران هم میتونستن خواب و رویاهای تورو ببینن',
      },
      {
        whatif: 'زیباترین یا عضلانی ترین بدن رو داشتی',
        but: 'قدرت بدنیت به اندازه یه بچه ۷ ساله بود',
      },
      {
        whatif: 'میتونستی با هرکسی که بخوای رابطه جنسی داشته باشی',
        but: 'هرکسی هم میتونست با تو رابطه جنسی داشته باشه',
      },
      {
        whatif: 'بالاترین قدرت شنوایی رو داشتی',
        but: 'هرشب باید به صدای رابطه جنسی همسایه‌ها گوش میدادی',
      },
      {
        whatif: 'میتونستی بهترین فیلم جهان رو بسازی',
        but: 'تولید این فیلم ۲۰ سال طول می‌کشید',
      },
      {
        whatif: 'بهترین فوتبالیست جهان بودی',
        but: 'یه کوتوله بودی',
      },
      {
        whatif: 'برای ۱۰ سال، ماهی ۲۰ میلیون درآمد داشتی',
        but: 'نمیتونستی هیچوقت لباس نداشته باشی حتی برای رفع نیازهات',
      },
      {
        whatif: 'خورشید میدرخشید هروقت خوشحال بودی',
        but: 'وقتی ناراحت بودی بارون میبارید',
      },
      {
        whatif: 'حقوق حال حاضرت ۳ برابر میشد',
        but: 'باید آبدارچی شرکتی که توشی میشدی',
      },
      {
        whatif: 'میتونستی هرکسی رو که بخوای زنده کنی',
        but: 'هروقت کسی رو زنده کنی باید انتخاب کنی که ینفرو رو بکشی',
      },
      {
        whatif: 'هرروز یک میلیون تومان میگرفتی',
        but: 'تا آخر عمرت گیاهخوار بودی',
      },
      {
        whatif: 'نینجایی فوق سریع، باهوش و قوی بودی',
        but: 'به شکل وحشیانه‌ای باید تمرین میکردی و هرگز کودکی نمیکردی',
      },
      {
        whatif: 'دنیا به صلح مطلق میرسید',
        but: 'هیچ لباسی دیگه روی زمین وجود نداشت',
      },
      {
        whatif: 'از البرت انشتین هم بهتر بودی و کشفیات بزرگ و جدیدی داشتی',
        but: 'هیجوقت خانوادت بهت افتخار نمیکردن',
      },
      {
        whatif: 'میتونستی با هرکسی که میخوای رابطه جنسی داشته باشی',
        but: 'دوستات و خانوادت همیشه در حال تماشای رابطتت بودن',
      },
      {
        whatif: 'هر ماشین و خونه ای که میخواستی میتونستی داشته باشی',
        but: 'هیج دوستی تو زندگیت نداشتی',
      },
      {
        whatif: 'میتونستی قدرت هر قهرمانی که میخوای رو داشته باشی',
        but: 'یه موجود خبیث همیشه به دنبالت بود تا تورو بکشه',
      },
      {
        whatif: 'درختی رو پرورش میدادی که برگ هاش پول بود',
        but: 'ولی با هربار پول کندن از درخت ۱۰۰ تا درخت دیگه خشک میشد',
      },
      {
        whatif: 'هرشب خوب میخوابیدی و هرروز خیلی خوشحال و پرانرژی بیدار میشدی',
        but: 'تا آخر عمرت باید تنها میخوابیدی',
      },
      {
        whatif: 'میتونستی جنسیتت رو تغییر بدی',
        but: 'پس از هر تغییر زشت تر از قبل میشدی',
      },
      {
        whatif: 'میتونستی خواب و رویاهات رو کنترل کنی',
        but: 'هیچوقت نمیتونستی بیش از ۵ ساعت بخوابی',
      },
      {
        whatif: 'بهترین و زیباترین بدن رو داشتی',
        but: 'پانزده سال از عمرت کم میشد',
      },
      {
        whatif: 'میتونستی به ۵۰ سال قبل سفر کنی',
        but: 'دیگه هیچوقت نمیتونستی با کسانی که امروز میشناسی صحبت کنی',
      },
      {
        whatif: 'دوبرابر زیباتر و جذاب تر میشدی',
        but: 'هوشت نصف میشد',
      },
      {
        whatif: 'به هر فیلم، کتاب، بازی و غذایی که میخواستی دسترسی داشتی',
        but: 'برای مدت ۱۰ سال نمیتونستی از خونت بری بیرون',
      },
      {
        whatif: 'یه قالیچه پرنده داشتی',
        but: 'هیچوقت نمیتونستی ازش پیاده بشی',
      },
      {
        whatif: 'میتونستی به ۵۰ سال آینده سفر کنی',
        but: 'بیست سال از عمرت کم میشد',
      },
      {
        whatif: 'میتونستی هرسازی که میخوای رو بنوازی',
        but: 'ولی هرروز باید ۳ ساعت مشخص رو ساز میزدی تا آخر عمر',
      },
      {
        whatif: 'ده میلیارد سرمایه داشتی',
        but: 'با گوسفندها زندگی میکردی',
      },
      {
        whatif: 'تصور کن یه کپی از خودت داشتی که هرکاری بهش میگفتی انجام میداد',
        but: 'عاشق کسی میشد که تو عاشقشی',
      },
      {
        whatif: 'میتونستی با چند نفر در رابطه عاشقانه باشی',
        but: 'هیچوقت نمیتونستی فقط با یک نفر در رابطه عاشقانه باشی',
      },
      {
        whatif: 'جاودانه بودی و هیچوقت نمیمردی',
        but: 'دیگه کسی باهات حرف نمیزد',
      },
      {
        whatif: 'هیچوقت سرما نمیخوردی',
        but: 'همیشه کفش هات لنگه به لنگه بود',
      },
      {
        whatif: 'میتونستی هر زبانی خواستی یاد بگیری',
        but: 'هیچوقت دیگه نمیتونستی به زبان مادرزادیت صحبت کنی',
      },
      {
        whatif: 'میتونستی توی خواب و رویاهات زندگی کنی',
        but: 'دیگه نمیتونستی ازشون خارج بشی',
      },
      {
        whatif: 'هیچوقت چاق نمیشدی',
        but: 'هیچوقت احساس گرسنگی رو تجربه نمیکردی',
      },
      {
        whatif: 'کره زمین به صلح مطلق می‌رسید',
        but: 'اینترنت برای همیشه نابود میشد',
      },
      {
        whatif: 'بدن خوش و فرم و سالمی داشتی',
        but: 'هرروز یک ساعت ورزش میکردی',
      },
      {
        whatif: 'میتونستی ۳ برابر بیشتر بپری',
        but: 'سرعت دویدنت نصف میشد',
      },
      {
        whatif: 'مردم تو رانندگی به هم احترام میگذاشتن و ترافیک نبود',
        but: 'هرروز تو مسیرت با ۳ نفر هم مسیر میشدی',
      },
      {
        whatif: 'هروقت دلت میخواست چاییت آماده بود',
        but: 'دیگه نمیتونستی قهوه بنوشی',
      },
      {
        whatif: 'میتونستی ۱۰ سال بیشتر زندگی کنی',
        but: 'هیچوقت نمیتونستی سیگار بکشی',
      },
      {
        whatif: 'همه دنیا رو بری بگردی',
        but: 'هیچوقت نمیتونستی تو یه شهر بیش از یک هفته متوالی بمونی',
      },
      {
        whatif: 'میتونستی توی امور کشور نظر بدی',
        but: 'همه مردم هم میتونستن در امور کشور نظر بدن از جمله گدای تو خیابون',
      },
      {
        whatif: 'میتونستی مشهورترین دانشمند جهان باشی',
        but: 'همیشه باید روی یه صندلی مینشستی',
      },
      {
        whatif: 'آدم بسیار مشهوری میشدی و همه مردم تا سالها تورو بخاطر داشتن',
        but: 'در ۳۰ سالگی میمردی',
      },
      {
        whatif: 'لامبورگینی داشتی',
        but: 'همیشه باید با صندل چوبی راه میرفتی',
      },
      {
        whatif: 'همیشه بهترین دمای دلخواهت رو تجربه میکردی',
        but: 'تخت خوابت همیشه یخ بود',
      },
      {
        whatif: 'هرکاری دلت خواست میتونستی انجام بدی بدون هیچ محدودیتی',
        but: 'همه مردم دنیا هم میتونستن',
      },
      {
        whatif: 'میتونستی مدیرعامل بزرگترین شرکت دنیا باشی',
        but: 'هر شب باید توی کارتن میخوابیدی',
      },
      {
        whatif:  'میتونستی به هر کشوری توی دنیا هروقت دلت خواست سفر کنی',
        but: 'دیگه هیچوقت نمیتونستی پدر و مادرت رو ببینی',
      },
      {
        whatif: 'خونت از جنس شکلات و کیک و بیسکوییت بود',
        but: 'باید حتما قند مورد نیاز بدنت رو از خونت میگرفتی',
      },
      {
        whatif: 'بزرگترین ترس زندگیت از بین میرفت',
        but: 'باید میدادیش به نزدیک‌ترین دوست زندگیت',
      },
      {
        whatif: 'هر خوابی دوست داشتی میتونستی ببینی',
        but: 'هیچوقت به واقعیت تبدیل نمیشدن',
      },
      {
        whatif: 'همیشه هر نوشیدنی‌ای که دوست داشتی توی یخچالت بود',
        but: 'دمپایی دستشویی همیشه خیس بود',
      },
      {
        whatif: 'بویاییت مثل یه سگ قوی میشد',
        but: 'پاهات همیشه بو میداد',
      },
      {
        whatif: 'یه میمون داشتی که کاراته بلد بود و میتونست برات بجنگه',
        but: 'باید روزی حداقل یک ساعت باهاش تمرین میکردی',
      },
      {
        whatif: 'میتونستی از توی دیوارا رد شی',
        but: 'هرشب قبل از خواب باید پاهاتو با مسواکت تمیز میکردی',
      },
    ].map(({ whatif, but }) => ({
        id: uuid(),
        type: 'WHAT_IF',
        choices: JSON.stringify([
          {
            id: uuid(),
            text: whatif,
          },
          {
            id: uuid(),
            text: but,
          },
        ]),
        created_at: new Date(),
        updated_at: new Date(),
      }
    )), {})
  },

  down: (queryInterface) => {
    return queryInterface.bulkDelete('questions', null, {})
  }
}
