'use strict'
const uuid = require('uuid').v4

module.exports = {
  up: (queryInterface, Sequelize) => {
    return queryInterface.bulkInsert('questions', [
      {
        whatif: 'میتونستی توی یه سیاره با چند گونه مختلف منتخب از فضایی ها زندگی کنی',
        but: 'دیگه نمیتونستی به زمین برگردی',
      },
      {
        whatif: 'میتونستی یه کار خیلی غیر قانونی انجام بدی',
        but: 'هیچکس روحشم خبردار نمیشد',
      },
      {
        whatif: 'حقیقت زندگی رو پیدا میکردی',
        but: 'باید هرچیزی که تاحالا یاد گرفتی رو فراموش میکردی',
      },
      {
        whatif: 'دو میلیون نفر میشناختنت',
        but: 'باید هر روز یکار چیپ کنی و از خودت فیلم بگیری',
      },
      {
        whatif: 'وقتی مردی به هرچیزی دوست داشتی میرسی',
        but: 'باید هرروز ۱ ساعت عذاب بکشی',
      },
      {
        whatif: 'هرروز از ساعت ۱ تا ۴ بعد از ظهر خیلی باهوش و قوی و خوشکل میشدی',
        but: 'ساعتای دیگه همون حالتارو نصف حالت عادی داشتی',
      },
      {
        whatif: 'پولدارترین آدم کشور بودی',
        but: 'سردسته فروش مواد مخدر بودی',
      },
      {
        whatif: 'هر روز ۵۰۰ هزارتومن میگرفتی',
        but: 'هر روز رنگ موهات عوض میشد',
      },
      {
        whatif: 'میتونستی ۵۰ سال در آینده سفر کنی',
        but: '۲۰ سال بعدش میمردی',
      },
      {
        whatif: 'میتونستی ظاهر پارتنرتو تعیین کنی هرجور دوست داری',
        but: 'اونم همین کارو میتونه بکنه',
      },
      {
        whatif: 'میتونستی شاه یا ملکه یه جایی بشی',
        but: 'باید با ینفر که دوست نداری ازدواج کنی',
      },
      {
        whatif: 'زندگی همه مردم دنیا لذت بخش و عالی بود',
        but: 'تو باید واسه ۲۰ سال شکنجه میشدی',
      },
      {
        whatif: 'میتونستی تو زمان سفر کنی',
        but: 'همیشه تنها بودی و با هیچکس نمیتونستی صحبت کنی',
      },
      {
        whatif: 'همون قدی بودی که میخواستی',
        but: 'زن بودی پارتنرت ۵۰ سانت از کوتاه تر و اگه مرد بودی ۵۰ سانت ازت بلند تر بود',
      },
      {
        whatif: 'میتونستی یک سال آینده رو ببینی',
        but: 'هرسال دوسال از اول زندگیت یادت میرفت',
      },
      {
        whatif: 'همه مردم سیاه‌پوست بودن',
        but: 'تو سفید پوست بودی',
      },
      {
        whatif: 'همه باد معده هات بی صدا بودن',
        but: 'بوشون دوبرابر بدتر بود',
      },
      {
        whatif: 'یخچالت همیشه پر از خوردنی های خوشمزه بود',
        but: 'هر هفته باید تو نماز جمعه شرکت میکردی',
      },
      {
        whatif: 'یکی از لاکچری ترین ویلا ها رو تو بهترین منطقه تهران داشتی',
        but: 'همه عمرت باید ایران میموندی',
      },
      {
        whatif: 'هر روز میتونستی با ینفر باشی و هیچکس نفهمه',
        but: 'ناهارتو همیشه باید نون پنیر میخوردی',
      },
      {
        whatif: 'میتونستی هر موقع به هر حیوونی که دوست داشتی تبدیل بشی',
        but: 'دیگه نمیتونستی انسان باشی',
      },
      {
        whatif: 'میتونستی مرد عنکبوتی باشی',
        but: 'هیچوقت نمیتونستی لباستو عوض کنی',
      },
      {
        whatif: 'میتونستی رئیس جمهور باشی و قدرتمند ترین آدم کشور',
        but: 'باید هر روز به مردم دروغ بگی',
      },
      {
        whatif: 'تا آخر زندگیت خوشحال و خوشبخت بودی',
        but: 'همیشه فقیر بودی و سبزی میفروختی',
      },
      {
        whatif: 'هر روز آگاهیت از خودت حداکثر میشد و باهوش تر و آرام تر بودی',
        but: 'باید هر روز صبح ساعت ۶ به مدت ۱ ساعت مدیتیشن میکردی',
      },
      {
        whatif: 'حقوقت چهار برابر میشد',
        but: 'قدت نصف میشد',
      },
      {
        whatif: 'یه جعبه داشتی که هرچیزی رو نامرئی میکرد',
        but: 'همیشه باید کفش و جوراباتو نامرئی کنی',
      },
      {
        whatif: 'میتونستی بفهمی چطوری قراره بمیری',
        but: 'هیچجوره دیگه نمیتونستی تغییرش بدی',
      },
      {
        whatif: 'میتونستی با ابی یه هفته برید بگردید و عشق و حال کنید',
        but: 'باید توی آهنگ بعدیش باهاش همخونی میکردی',
      },
      {
        whatif: 'صلح بر همه‌جا حکم فرما بود',
        but: 'اینترنت وجود نداشت',
      },
      {
        whatif: 'میتونستی یروز ۵۰۰ سال در آینده سفر کنی',
        but: 'وفتی برمیگشتی با هیچکس نمیتونستی رابطه داشته باشی',
      },
      {
        whatif: 'میتونستی هر لباسی دلت میخواد رو از هر مغازه ای مفتی بگیری',
        but: 'هیچوقت لباسات با هم ست نبود',
      },
      {
        whatif: 'همه غذاهایی که میخوری رو یه آشپز حرفه ای درست میکرد',
        but: 'همیشه باید با دست غذا میخوردی همه جا',
      },
      {
        whatif: 'ترافیک و آلودگی هوا از بین میرفت',
        but: 'باید همیشه از وسیله نقلیه عمومی استفاده میکردی',
      },
      {
        whatif: 'اینترنتت نامحدود میشد با سرعت خیلی خفن!',
        but: 'هفته ای یبار یروز کلا اینترنت نداشتی',
      },
      {
        whatif: 'به راننده شخصی داشتی که هرموقع و هرجا میبردت رایگان',
        but: 'ماشینش پیکان بود',
      },
      {
        whatif: 'همه مردم سفید پوست بودن',
        but: 'تو سیاه پوست بودی',
      },
      {
        whatif: 'حجاب آزاد میشد',
        but: 'تو ماشین همیشه باید رادیو گوش میکردی',
      },
      {
        whatif: 'میتونستی پنجاه سال سالم بیشتر زندگی کنی',
        but: 'هیچوقت نمیتونستی جوراب و لباس زیرتو عوض کنی',
      },
    ].map(({ whatif, but }) => ({
        id: uuid(),
        type: 'WHAT_IF',
        choices: JSON.stringify([
          {
            id: uuid(),
            text: whatif,
          },
          {
            id: uuid(),
            text: but,
          },
        ]),
        created_at: new Date(),
        updated_at: new Date(),
      }
    )), {})
  },

  down: (queryInterface) => {
    return queryInterface.bulkDelete('questions', null, {})
  }
}
